{
  "artifacts": [
    {
      "id": "A001",
      "name": "Kandyan Sword (Kasthāne)",
      "category": "Royal Ceremonial Sword",
      "origin": "Sri Lanka — Kandyan Kingdom",
      "era": "17th–18th century",
      "dimensions": "60–70 cm total length",
      "materials": "Forged steel blade; brass/silver hilt; wood; gemstone inlays",
      "function": "Used in royal ceremonies, investitures, and as visible rank insignia. Carried by nobles during processions and occasionally used in ritualized demonstrations of martial skill; also part of diplomatic gift exchanges.",
      "symbolism": "Embodies royal authority, protector role of the king, and the martial lineage of Kandyan aristocracy. The Makara/dragon motifs mark protective power and link to mythical guardians.",
      "location": "National Museum, Colombo (representative)",
      "notes": "Hilt often shaped like a Makara (mythical sea-creature). Many examples show inlay work, ceremonial scabbards, and are inscribed or gifted as diplomacy tokens; some blades were intentionally blunted for ceremonial use.",
      "is_sri_lankan": true,
      "image": "images/A001_Sword.jpg"
    },
    {
      "id": "C001",
      "name": "Japanese Katana",
      "category": "Warrior Sword",
      "origin": "Japan",
      "era": "Kamakura–Edo period",
      "dimensions": "Blade ~70 cm",
      "materials": "Folded tamahagane steel; ray-skin; silk cord",
      "function": "Primary battlefield and dueling weapon historically; later a status and ritual item. Used in paired sets (daisho) and in ceremonial rites like seppuku/installation rituals; sometimes mounted at shrines.",
      "symbolism": "Represents bushidō values (honor, loyalty, discipline). Considered an extension of the warrior’s identity — “soul of the samurai” — with ritualized care, mounting, and presentation.",
      "location": "Tokyo National Museum (representative)",
      "notes": "Forged with folding and differential hardening (hamon). Tsuba (guard) often artistically decorated; many katanas have provenance records and smith signatures (mei).",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A002",
      "name": "Geta Bera (Kandyan Drum)",
      "category": "Dance / Ritual Drum",
      "origin": "Sri Lanka",
      "era": "15th century – present",
      "dimensions": "45–60 cm long",
      "materials": "Jackfruit wood body; cow/monkey hide heads; rope braces",
      "function": "Provides the rhythmic backbone of Kandyan dance forms and ritual processions. Sets tempo for dancers, signals choreographic changes, and accompanies chant and percussion ensembles in temple ceremonies.",
      "symbolism": "Signifies sacred beat linking community and deity; rhythmic patterns mark ritual phases and solemnity, and the drum’s sound is considered to call or please protective spirits.",
      "location": "Kandy region temples; cultural dance schools",
      "notes": "Double-headed construction tuned asymmetrically for tonal contrast. Drummers often undergo training that includes ritual purification; sticks and playing techniques are specific to each dance type (Ves, Naiyandi).",
      "is_sri_lankan": true,
      "image": "images/A002_Geta_Bera.jpg"
    },
    {
      "id": "C002",
      "name": "Japanese Taiko Drum",
      "category": "Festival Drum",
      "origin": "Japan",
      "era": "Ancient – present",
      "dimensions": "Small hand drums up to 1–2 m",
      "materials": "Hollowed zelkova or keyaki wood; animal hide",
      "function": "Used for religious processions, ensemble performance (kumi-daiko), theatrical accompaniment (Noh/ Kabuki), and community signaling. In modern performance, taiko creates dramatic, choreographed ensemble shows.",
      "symbolism": "Expresses communal cohesion, ritual presence, and the visceral power of sound; large taiko embody public energy and sacred force in festivals.",
      "location": "Temples, performance centers across Japan",
      "notes": "Variety of sizes; some taiko are portable for parades, others are massive and stationary. Contemporary groups (e.g., Kodo) have revived and globalized taiko performance.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A003",
      "name": "Kandyan Temple Mural",
      "category": "Buddhist Mural Art",
      "origin": "Sri Lanka",
      "era": "18th–19th century",
      "dimensions": "Several meters across temple walls",
      "materials": "Lime plaster; mineral pigments; organic binders; occasional gold leaf",
      "function": "Serves as didactic visual scripture: instructs lay patrons in Jataka tales and ethical precepts, supports liturgy, and visually anchors devotional space for worship. Murals also expressed royal patronage.",
      "symbolism": "Symbolizes moral order, karmic consequences, and the sanctity of the monastic community; murals encode cosmology and ethical exemplars for believers.",
      "location": "Degaldoruwa, Dambulla, and Kandyan temples",
      "notes": "Restricted palette (reds, yellows, blacks) and flattened perspective; pigments derived from local minerals and organic binders cause particular conservation needs. Many murals have layered retouching histories tied to temple restorations.",
      "is_sri_lankan": true,
      "image": "images/A003_M1.jpg"
    },
    {
      "id": "C003",
      "name": "Thai Temple Mural",
      "category": "Buddhist Temple Mural",
      "origin": "Thailand",
      "era": "18th–19th century",
      "dimensions": "Full-wall panels",
      "materials": "Mineral pigments, gold leaf, plaster",
      "function": "Narrates epic cycles and Buddhist instruction for devotees; murals are integrated with ritual procession routes and icon display. Commissioned by royal or monastic patrons for instruction and prestige.",
      "symbolism": "Conveys royal religious legitimacy, cosmic order, and idealized moral conduct; gold leaf raises sacredness and signals elite sponsorship.",
      "location": "Major Thai wats (e.g., Wat Pho)",
      "notes": "Highly detailed narrative registers, rich color palette and gold highlight; murals often reflect courtly aesthetics and include donor portraits.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A004",
      "name": "Sri Lankan Clay Pot",
      "category": "Domestic Pottery",
      "origin": "Sri Lanka",
      "era": "1000 BCE – present",
      "dimensions": "20–40 cm height",
      "materials": "Local red/yellow clay; sand or organic temper",
      "function": "Everyday vessel for cooking (esp. rice), water cooling and storage, fermenting foods, and sometimes ritual libations. Form and surface finish reflect function (pouring spouts, rims for lids).",
      "symbolism": "Symbolic of domestic continuity, hospitality, and elemental connection to earth; pot forms are integrated into ritual food offerings and seasonal cycles.",
      "location": "Rural households; regional pottery centers",
      "notes": "Unglazed porous bodies allow evaporative cooling; traditional pots are made by coiling or wheel techniques and may be fired in open kilns. Decorative motifs vary regionally.",
      "is_sri_lankan": true,
      "image": "images/A004_C2.jpg"
    },
    {
      "id": "C004",
      "name": "Egyptian Amphora",
      "category": "Storage Vessel",
      "origin": "Ancient Egypt",
      "era": "1500–500 BCE",
      "dimensions": "50–70 cm",
      "materials": "Terracotta; slip coatings and painted pigments",
      "function": "Long-distance transport containers for oil, wine, salted fish and grains; used in domestic storage and as grave goods. Shapes relate to shipping and storage efficiency.",
      "symbolism": "Emblem of trade networks, wealth, and civic provisioning; decorated amphora often reflect mythological or civic identity.",
      "location": "Archaeological sites in the Nile Delta; museums (e.g., British Museum)",
      "notes": "Biconical bodies, twin handles and narrow necks optimized for stowage and pouring; painted or stamped indices can indicate contents or makers.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A005",
      "name": "Kolam Mask",
      "category": "Folk Drama Mask",
      "origin": "Sri Lanka (Southern Province)",
      "era": "17th century – present",
      "dimensions": "25–40 cm height",
      "materials": "Kaduru (native hardwood), plant pigments, lacquer",
      "function": "Central prop for Kolam performances — masks animate characters in satirical plays that comment on village life, social norms and morality. Also used in healing/demonstrative rites.",
      "symbolism": "Embodies social critique and cultural memory; masks play dual roles as entertainment and social correction, often encoding local cosmologies.",
      "location": "Ambalangoda mask-making villages; performance troupes",
      "notes": "Masks are carved to specific character types (villagers, demons, kings). Painted colors indicate temperament; lightweight woods chosen for mobility during dance.",
      "is_sri_lankan": true,
      "image": "images/A005_Kolam_devil_mask_Wellcome_L0037158.jpg"
    },
    {
      "id": "C005",
      "name": "African Ritual Mask",
      "category": "Ceremonial Mask",
      "origin": "West/Central Africa",
      "era": "Ancient – present",
      "dimensions": "30–50 cm",
      "materials": "Local hardwoods, natural pigments, beads, raffia",
      "function": "Worn during initiation ceremonies, harvest rites, funerary and royal performances; often integrated with dance, music, and sacrifice. Masks activate social and spiritual functions.",
      "symbolism": "Serve as intermediaries to ancestors and spirits; they mediate community identity, moral law, and fertility/protection rites.",
      "location": "Ethnographic collections; regional museum contexts",
      "notes": "Often part of a full costume ensemble; specific masks are restricted to initiated members and may be ritually charged (consecrated).",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A006",
      "name": "Laksha Lacquerware",
      "category": "Decorative Craft",
      "origin": "Sri Lanka",
      "era": "16th century – present",
      "dimensions": "Small boxes, rods, ritual implements",
      "materials": "Seasoned wood, lac (natural resin), plant dyes",
      "function": "Functional as containers for ritual substances, personal ornaments, or processional items; also used as decorative gifts and temple offerings.",
      "symbolism": "Symbolizes refinement, prosperity, and continuity of handcraft lineage; lacquer sheen signals protection and value.",
      "location": "Kandy, Matale craft centers",
      "notes": "Made on lathes with successive lacquer layers rubbed to polish; patterns often use circular/spiral motifs; dyes come from local plant sources.",
      "is_sri_lankan": true,
      "image": null
    },
    {
      "id": "C006",
      "name": "Channapatna Lacquerware",
      "category": "Traditional Craft",
      "origin": "India (Karnataka)",
      "era": "18th century – present",
      "dimensions": "Toys, boxes, small furniture",
      "materials": "Turned wood (woolly-wood), lacquer, natural dyes",
      "function": "Domestic decorative objects and children’s toys; historically trade items.",
      "symbolism": "Represents community-level artisan systems and regional identity; brightly colored forms connote cheerful domesticity.",
      "location": "Channapatna craft workshops",
      "notes": "Recognized with GI status; natural dyes and lacquering techniques are preserved through craft schools.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A007",
      "name": "Brass Oil Lamp (Pahana)",
      "category": "Ritual Lamp",
      "origin": "Sri Lanka",
      "era": "Ancient – present",
      "dimensions": "20–40 cm",
      "materials": "Brass/bronze alloys",
      "function": "Lit in temples, shrines and domestic altars during puja, processions and festivals; also used to inaugurate events and mark auspicious starts.",
      "symbolism": "Represents dispelling of ignorance by light; lamp-lighting is both devotional act and social ritual signalling hospitality and blessing.",
      "location": "Temples, households island-wide",
      "notes": "Often shaped with culturally resonant motifs (peacock, elephant). Permits multiple wicks; sometimes carried on processional poles.",
      "is_sri_lankan": true,
      "image": null
    },
    {
      "id": "C007",
      "name": "Indian Deepam Lamp",
      "category": "Ritual Lamp",
      "origin": "South India",
      "era": "Ancient – present",
      "dimensions": "20–40 cm",
      "materials": "Bronze/brass",
      "function": "Central in Hindu puja practice: lit before deities, used in arati and festival observances (e.g., Deepavali).",
      "symbolism": "Symbolizes divine presence, prosperity and grace; light connects mundane to divine.",
      "location": "Temple treasuries and household shrines",
      "notes": "Lamps often form part of ritual paraphernalia set; some are richly ornamented with iconography of Lakshmi or Shiva.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A008",
      "name": "Beeralu Lace (Bobbin Lace)",
      "category": "Textile Craft",
      "origin": "Sri Lanka",
      "era": "1500s – present",
      "dimensions": "Lace strips of variable width",
      "materials": "Cotton thread, wooden bobbins",
      "function": "Used to embellish garments, religious textiles, and household linens; lace-making is a domestic craft that supported women’s incomes and social networks.",
      "symbolism": "Represents fine handwork, female artistic labor, and cultural exchange (Portuguese influence).",
      "location": "Galle & Matara lace guilds",
      "notes": "Design complexity varies by locale; tools include lace pillows and pins. Some patterns are unique family motifs preserved across generations.",
      "is_sri_lankan": true,
      "image": null
    },
    {
      "id": "C008",
      "name": "Belgian Bobbin Lace",
      "category": "Fine Textile",
      "origin": "Belgium",
      "era": "15th century – present",
      "dimensions": "Intricate lace panels",
      "materials": "Linen, silk, sometimes metallic threads",
      "function": "High-status clothing, ecclesiastical vestments, ceremonial linens.",
      "symbolism": "Signifies aristocratic taste, refinement and luxury craftsmanship.",
      "location": "Bruges lace centers, museums",
      "notes": "Technique produces extremely fine openwork; lace patterns may identify region or workshop.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A009",
      "name": "Kurahan Gala / Miris Gala (Grinding Stone)",
      "category": "Domestic Tool",
      "origin": "Sri Lanka",
      "era": "Prehistoric – present",
      "dimensions": "30–50 cm slab",
      "materials": "Granite",
      "function": "Primary household implement for milling grains (kurakkan), spices and chilies; often used daily in food preparation and ritual food production.",
      "symbolism": "Symbol of domestic continuity, female labor and food sovereignty; often inherits familial significance.",
      "location": "Rural households",
      "notes": "Hand-operated method imparts distinctive texture and flavor. Stone often kept as family heirloom with care.",
      "is_sri_lankan": true,
      "image": null
    },
    {
      "id": "C009",
      "name": "Mayan Metate",
      "category": "Grinding Stone",
      "origin": "Central America",
      "era": "2000 BCE – present",
      "dimensions": "30–50 cm",
      "materials": "Basalt/volcanic stone",
      "function": "Grinding maize and other staples for daily meals (tortillas), and in ritual contexts for offering preparations.",
      "symbolism": "Represents female domestic role, sustenance, and cultural continuity; some metates have ritualized designs.",
      "location": "Indigenous communities; museums",
      "notes": "Often anthropomorphized in ceremonial pieces. Design and use persist in many communities.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A010",
      "name": "Sandakada Pahana (Moonstone)",
      "category": "Temple Entrance Stone",
      "origin": "Sri Lanka",
      "era": "1st century BCE – 12th century CE",
      "dimensions": "1–2 m diameter semicircle",
      "materials": "Granite",
      "function": "Placed at temple thresholds to mark and sanctify the transition from profane to sacred space; also tied to ritual movement during processions.",
      "symbolism": "Embodies cosmological cycles (samsara), purity and progression toward liberation; animals and floral bands encode moral and cosmological meanings.",
      "location": "Anuradhapura, Polonnaruwa archaeological sites",
      "notes": "Carving follows a consistent banded program: outer flames, animals, creepers and central lotus. Moonstones are diagnostic of Sri Lankan Buddhist architecture.",
      "is_sri_lankan": true,
      "image": "images/A010_P1.jpg"
    },
    {
      "id": "C010",
      "name": "Indian Temple Threshold Stone",
      "category": "Sacred Stone Carving",
      "origin": "India",
      "era": "600–1200 CE",
      "dimensions": "1–2 m",
      "materials": "Granite or sandstone",
      "function": "Serves as entrance feature for temples, often used in ritual circumambulation and marking auspicious thresholds.",
      "symbolism": "Represents purification, auspiciousness and protection; threshold carvings often include deities, lotus and guardian motifs.",
      "location": "South Indian temples (Tamil Nadu)",
      "notes": "Thresholds often integrated with carved doorframes (toranas) and elaborate lintels; iconography may vary by sectarian association (Shaiva/Vaishnava).",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A011",
      "name": "Punkalasa (Pot of Plenty)",
      "category": "Ritual Symbol / Sculpture",
      "origin": "Sri Lanka",
      "era": "Ancient – present",
      "dimensions": "20–40 cm",
      "materials": "Terracotta or carved stone",
      "function": "Used as votive motif or temple ornament symbolizing abundance and invoked in harvest/royal rituals; sometimes present in temple iconography or processions.",
      "symbolism": "Emblems of fertility, prosperity, and royal largesse — pot overflowing with produce denotes blessing and sustenance.",
      "location": "Anuradhapura, Polonnaruwa",
      "notes": "Often sculpted as part of temple friezes or freestanding vessels; may be painted or gilded in sacred contexts.",
      "is_sri_lankan": true,
      "image": "images/A011_I1.jpg"
    },
    {
      "id": "C011",
      "name": "Greek Cornucopia (Horn of Plenty)",
      "category": "Ritual Symbol",
      "origin": "Greece",
      "era": "4th century BCE – Roman era",
      "dimensions": "30–50 cm",
      "materials": "Clay, bronze, marble",
      "function": "Used as votive and decorative motif in art and ritual scenes celebrating harvest and abundance.",
      "symbolism": "Classical emblem of prosperity tied to agricultural gods (e.g., Demeter) and civic wellbeing.",
      "location": "Museum collections (Athens, Delphi)",
      "notes": "Often depicted overflowing with fruit and grain; appears in funerary and domestic contexts.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A012",
      "name": "Wangediya Mortar (Granite mortar)",
      "category": "Domestic Tool",
      "origin": "Sri Lanka",
      "era": "Prehistoric – present",
      "dimensions": "Bowl 20–30 cm depth",
      "materials": "Granite",
      "function": "Used to grind herbs, spices and prepare Ayurvedic pastes; essential in household and medicinal preparations.",
      "symbolism": "Represents healing knowledge and domestic food technology passed through families.",
      "location": "Rural households; Ayurvedic centers",
      "notes": "Often heavy and durable; sometimes inscribed with maker marks; paired with wooden pestle (mol gaha).",
      "is_sri_lankan": true,
      "image": "images/A012_1.jpg"
    },
    {
      "id": "C012",
      "name": "Japanese Suribachi Mortar",
      "category": "Domestic Tool",
      "origin": "Japan",
      "era": "Heian period – present",
      "dimensions": "15–25 cm",
      "materials": "Ceramic with internal ridges",
      "function": "Ideal for grinding sesame, spice blends and making sauces/condiments; kitchen staple for fine emulsification.",
      "symbolism": "Embodies culinary refinement and ritualized food preparation in household kitchens.",
      "location": "Japanese households, kitchens",
      "notes": "Interior combed ridges (kushi) increase grinding efficiency; typically used with wooden pestle (surikogi).",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A013",
      "name": "Kandyan Silver Jewelry (Nalalpati, Earrings)",
      "category": "Traditional Jewelry",
      "origin": "Sri Lanka (Kandy)",
      "era": "17th–19th century",
      "dimensions": "Varies (small wearable pieces)",
      "materials": "Silver, gold plating, semi-precious stones",
      "function": "Worn for status display in weddings, temple offerings, dance costumes and as family heirlooms; used to identify caste/region in some contexts.",
      "symbolism": "Signals wealth, ritual readiness, and regional identity; often linked to temple donation practices.",
      "location": "Temple treasuries; private collections in Kandy",
      "notes": "Features filigree, granulation, and repoussé techniques; jewelry documents trade ties via gem materials and stylistic influences.",
      "is_sri_lankan": true,
      "image": "images/A013_nissaka_3.jpg"
    },
    {
      "id": "C013",
      "name": "Mughal Silver Jewelry",
      "category": "Royal Jewelry",
      "origin": "India (Mughal courts)",
      "era": "16th–18th century",
      "dimensions": "Small jewelry items",
      "materials": "Silver, gold, pearls, gemstones",
      "function": "Designed for court display, ceremonial dress, and as diplomatic gifts; often part of imperial treasure.",
      "symbolism": "Expresses imperial power, cosmopolitan taste (Persian influence) and devotional patronage.",
      "location": "Museum collections (Delhi, London)",
      "notes": "Intricate stone settings, enamel work (meenakari) in some pieces; provenance can often be traced through court records.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A014",
      "name": "Wooden Pillar Carvings (Embekke-style)",
      "category": "Architectural Carving",
      "origin": "Sri Lanka",
      "era": "12th–18th century",
      "dimensions": "1–2 m pillars",
      "materials": "Jack, teak or local hardwood",
      "function": "Structural posts for temple halls and palace pavilions that also carry narrative and decorative carving; integrate iconography with structural function.",
      "symbolism": "Signify royal patronage, devotional stories, and skilled craft lineage; carved motifs may include protective and auspicious figures.",
      "location": "Embekke Devalaya and other historic sites",
      "notes": "Extremely high relief carving with dancers, wrestlers, floral patterns; joinery techniques avoid metal fasteners in some examples.",
      "is_sri_lankan": true,
      "image": null
    },
    {
      "id": "C014",
      "name": "Balinese Temple Wood Carvings",
      "category": "Architectural Carving",
      "origin": "Indonesia (Bali)",
      "era": "14th c.–present",
      "dimensions": "1–2 m panels/pillars",
      "materials": "Teak, jack or local hardwood",
      "function": "Decorate temple gateways, shrines and domestic shrines; act as narrative surfaces and protective talismans.",
      "symbolism": "Represent mythic stories (Ramayana/Mahabharata), guardian beings and auspicious symbols that protect the temple precinct.",
      "location": "Balinese temple complexes",
      "notes": "Often painted/gilded; high relief with swirling vegetal patterns and animated guardian figures; carved by specialized families.",
      "is_sri_lankan": false,
      "image": null
    },
    {
      "id": "A015",
      "name": "Brass Betel Cutter (Bulath Kaduwa)",
      "category": "Ritual / Social Tool",
      "origin": "Sri Lanka",
      "era": "17th century – present",
      "dimensions": "15–25 cm",
      "materials": "Brass, iron",
      "function": "Used during betel-chewing ceremonies to cut areca nut leaves and prepare betel offerings for guests and during rituals like weddings.",
      "symbolism": "Signifies hospitality, reciprocal social bonds, and ritual courtesy; betel sets are important in social negotiation and ceremony.",
      "location": "Household altars; social gatherings",
      "notes": "Designs often stylized (birds, fish, religious motifs); part of a set that includes betel tray, lime box and nut pick.",
      "is_sri_lankan": true,
      "image": null
    },
    {
      "id": "C015",
      "name": "Chinese / SE Asian Areca Nut Cutter",
      "category": "Social Tool",
      "origin": "China & SE Asia",
      "era": "Qing period – present",
      "dimensions": "10–20 cm",
      "materials": "Bronze, iron",
      "function": "Used to slice areca nut for betel-chewing in social and ritual contexts; tool carried in social sets.",
      "symbolism": "Emphasizes hospitality, social reciprocity, and ritualized daily practice across many Asian cultures.",
      "location": "Regional ethnography collections",
      "notes": "Often engraved with dragons or auspicious emblems; used in both secular and ceremonial contexts.",
      "is_sri_lankan": false,
      "image": null
    }
  ],
  "artifact_index": {
    "A001": 0,
    "C001": 1,
    "A002": 2,
    "C002": 3,
    "A003": 4,
    "C003": 5,
    "A004": 6,
    "C004": 7,
    "A005": 8,
    "C005": 9,
    "A006": 10,
    "C006": 11,
    "A007": 12,
    "C007": 13,
    "A008": 14,
    "C008": 15,
    "A009": 16,
    "C009": 17,
    "A010": 18,
    "C010": 19,
    "A011": 20,
    "C011": 21,
    "A012": 22,
    "C012": 23,
    "A013": 24,
    "C013": 25,
    "A014": 26,
    "C014": 27,
    "A015": 28,
    "C015": 29
  }
}